export interface Nationality {
  code: string;
  name: string;
}

export const nationalityData: Nationality[] = [
  {
    code: '764',
    name: 'ไทย'
  },
  {
    code: '104',
    name: 'พม่า'
  },
  {
    code: '116',
    name: 'กัมพูชา'
  },
  {
    code: '418',
    name: 'สาธารณรัฐประชาธิปไตยประชาชนลาว'
  },
  {
    code: '156',
    name: 'จีน'
  },
  {
    code: '356',
    name: 'อินเดีย'
  },
  {
    code: '826',
    name: 'สหราชอาณาจักร (อังกฤษ)'
  },
  {
    code: '276',
    name: 'เยอรมนี'
  },
  {
    code: '608',
    name: 'ฟิลิปปินส์'
  },
  {
    code: '704',
    name: 'เวียดนาม'
  },
  {
    code: '392',
    name: 'ญี่ปุ่น'
  },
  {
    code: '840',
    name: 'สหรัฐอเมริกา'
  },
  {
    code: '634',
    name: 'กาตาร์'
  },
  {
    code: '398',
    name: 'คาซัคสถาน'
  },
  {
    code: '417',
    name: 'คีร์กีซสถาน'
  },
  {
    code: '414',
    name: 'คูเวต'
  },
  {
    code: '268',
    name: 'จอร์เจีย'
  },
  {
    code: '400',
    name: 'จอร์แดน'
  },
  {
    code: '682',
    name: 'ซาอุดิอาระเบีย'
  },
  {
    code: '196',
    name: 'ไซปรัส'
  },
  {
    code: '275',
    name: 'ดินแดนภายใต้การปกครองของปาเลสไตน์'
  },
  {
    code: '626',
    name: 'ติมอร์-เลสเต'
  },
  {
    code: '792',
    name: 'ตุรกี'
  },
  {
    code: '795',
    name: 'เติร์กเมนิสถาน'
  },
  {
    code: '888',
    name: 'ไต้หวัน'
  },
  {
    code: '762',
    name: 'ทาจิกิสถาน'
  },
  {
    code: '524',
    name: 'เนปาล'
  },
  {
    code: '096',
    name: 'บรูไนดารุสซาลาม'
  },
  {
    code: '050',
    name: 'บังกลาเทศ'
  },
  {
    code: '048',
    name: 'บาห์เรน'
  },
  {
    code: '586',
    name: 'ปากีสถาน'
  },
  {
    code: '064',
    name: 'ภูฏาน'
  },
  {
    code: '496',
    name: 'มองโกเลีย'
  },
  {
    code: '462',
    name: 'มัลดีฟส์'
  },
  {
    code: '446',
    name: 'มาเก๊า  เขตบริหารพิเศษของจีน'
  },
  {
    code: '458',
    name: 'มาเลเซีย'
  },
  {
    code: '887',
    name: 'เยเมน'
  },
  {
    code: '422',
    name: 'เลบานอน'
  },
  {
    code: '144',
    name: 'ศรีลังกา'
  },
  {
    code: '784',
    name: 'สหรัฐอาหรับเอมิเรตส์'
  },
  {
    code: '410',
    name: 'สาธารณรัฐเกาหลี (เกาหลีใต้)'
  },
  {
    code: '408',
    name: 'สาธารณรัฐประชาธิปไตยประชาชนเกาหลี (เกาหลีเหนือ)'
  },
  {
    code: '760',
    name: 'สาธารณรัฐอาหรับซีเรีย'
  },
  {
    code: '702',
    name: 'สิงคโปร์'
  },
  {
    code: '004',
    name: 'อัฟกานิสถาน'
  },
  {
    code: '031',
    name: 'อาเซอร์ไบจาน'
  },
  {
    code: '051',
    name: 'อาร์เมเนีย'
  },
  {
    code: '360',
    name: 'อินโดนีเซีย'
  },
  {
    code: '368',
    name: 'อิรัก'
  },
  {
    code: '376',
    name: 'อิสราเอล'
  },
  {
    code: '364',
    name: 'อิหร่าน (สาธารณรัฐอิสลาม)'
  },
  {
    code: '860',
    name: 'อุซเบกิสถาน'
  },
  {
    code: '512',
    name: 'โอมาน'
  },
  {
    code: '344',
    name: 'ฮ่องกง เขตบริหารพิเศษของจีน'
  },
  {
    code: '831',
    name: 'เกิร์นซีย์'
  },
  {
    code: '300',
    name: 'กรีซ'
  },
  {
    code: '304',
    name: 'กรีนแลนด์'
  },
  {
    code: '312',
    name: 'กวาเดอลูป'
  },
  {
    code: '833',
    name: 'เกาะแมน'
  },
  {
    code: '191',
    name: 'โครเอเชีย'
  },
  {
    code: '832',
    name: 'เจอร์ซีย์'
  },
  {
    code: '674',
    name: 'ซานมารีโน'
  },
  {
    code: '654',
    name: 'เซนต์เฮเลนา'
  },
  {
    code: '891',
    name: 'เซอร์เบียและมอนเตเนโกร'
  },
  {
    code: '666',
    name: 'แซงปีแยร์และมีเกอลง'
  },
  {
    code: '208',
    name: 'เดนมาร์ก'
  },
  {
    code: '578',
    name: 'นอร์เวย์'
  },
  {
    code: '540',
    name: 'นิวแคลิโดเนีย'
  },
  {
    code: '528',
    name: 'เนเธอร์แลนด์'
  },
  {
    code: '530',
    name: 'เนเธอร์แลนด์แอนทิลลิส'
  },
  {
    code: '070',
    name: 'บอสเนียและเฮอร์เซโกวีนา'
  },
  {
    code: '100',
    name: 'บัลแกเรีย'
  },
  {
    code: '056',
    name: 'เบลเยียม'
  },
  {
    code: '112',
    name: 'เบลารุส'
  },
  {
    code: '060',
    name: 'เบอร์มิวดา'
  },
  {
    code: '620',
    name: 'โปรตุเกส'
  },
  {
    code: '616',
    name: 'โปแลนด์'
  },
  {
    code: '250',
    name: 'ฝรั่งเศส'
  },
  {
    code: '612',
    name: 'พิตแคร์น'
  },
  {
    code: '246',
    name: 'ฟินแลนด์'
  },
  {
    code: '254',
    name: 'เฟรนช์เกียนา'
  },
  {
    code: '258',
    name: 'เฟรนช์โปลินีเซีย'
  },
  {
    code: '500',
    name: 'มอนต์เซอร์รัต'
  },
  {
    code: '470',
    name: 'มอลตา'
  },
  {
    code: '175',
    name: 'มายอต'
  },
  {
    code: '474',
    name: 'มาร์ตินีก'
  },
  {
    code: '492',
    name: 'โมนาโก'
  },
  {
    code: '292',
    name: 'ยิบรอลตาร์'
  },
  {
    code: '804',
    name: 'ยูเครน'
  },
  {
    code: '638',
    name: 'เรอูนียง'
  },
  {
    code: '642',
    name: 'โรมาเนีย'
  },
  {
    code: '442',
    name: 'ลักเซมเบิร์ก'
  },
  {
    code: '428',
    name: 'ลัตเวีย'
  },
  {
    code: '438',
    name: 'ลิกเตนสไตน์'
  },
  {
    code: '440',
    name: 'ลิทัวเนีย'
  },
  {
    code: '724',
    name: 'สเปน'
  },
  {
    code: '703',
    name: 'สโลวะเกีย'
  },
  {
    code: '705',
    name: 'สโลวีเนีย'
  },
  {
    code: '756',
    name: 'สวิตเซอร์แลนด์'
  },
  {
    code: '752',
    name: 'สวีเดน'
  },
  {
    code: '643',
    name: 'สหพันธรัฐรัสเซีย'
  },
  {
    code: '203',
    name: 'สาธารณรัฐเช็ก'
  },
  {
    code: '498',
    name: 'สาธารณรัฐมอลโดวา'
  },
  {
    code: '807',
    name: 'สาธารณรัฐยูโกสลาฟแห่งมาซิโดเนีย'
  },
  {
    code: '830',
    name: 'หมู่เกาะแชนเนล'
  },
  {
    code: '796',
    name: 'หมู่เกาะเติกส์และหมู่เกาะเคคอส'
  },
  {
    code: '092',
    name: 'หมู่เกาะบริติชเวอร์จิน'
  },
  {
    code: '238',
    name: 'หมู่เกาะฟอล์กแลนด์ (มาลบีนาส)'
  },
  {
    code: '234',
    name: 'หมู่เกาะแฟโร'
  },
  {
    code: '876',
    name: 'หมู่เกาะวาลลิสและหมู่เกาะฟุตูนา'
  },
  {
    code: '744',
    name: 'หมู่เกาะสฟาลบาร์และยานไมเอน'
  },
  {
    code: '248',
    name: 'หมู่เกาะโอลันด์'
  },
  {
    code: '040',
    name: 'ออสเตรีย'
  },
  {
    code: '020',
    name: 'อันดอร์รา'
  },
  {
    code: '533',
    name: 'อารูบา'
  },
  {
    code: '380',
    name: 'อิตาลี'
  },
  {
    code: '233',
    name: 'เอสโตเนีย'
  },
  {
    code: '660',
    name: 'แองกวิลลา'
  },
  {
    code: '008',
    name: 'แอลเบเนีย'
  },
  {
    code: '352',
    name: 'ไอซ์แลนด์'
  },
  {
    code: '372',
    name: 'ไอร์แลนด์'
  },
  {
    code: '336',
    name: 'ฮอลีซี'
  },
  {
    code: '348',
    name: 'ฮังการี'
  },
  {
    code: '320',
    name: 'กัวเตมาลา'
  },
  {
    code: '328',
    name: 'กายอานา'
  },
  {
    code: '308',
    name: 'เกรเนดา'
  },
  {
    code: '188',
    name: 'คอสตาริกา'
  },
  {
    code: '192',
    name: 'คิวบา'
  },
  {
    code: '170',
    name: 'โคลอมเบีย'
  },
  {
    code: '388',
    name: 'จาเมกา'
  },
  {
    code: '152',
    name: 'ชิลี'
  },
  {
    code: '740',
    name: 'ซูรินาเม'
  },
  {
    code: '659',
    name: 'เซนต์คิตส์และเนวิส'
  },
  {
    code: '662',
    name: 'เซนต์ลูเซีย'
  },
  {
    code: '670',
    name: 'เซนต์วินเซนต์และเกรนาดีนส์'
  },
  {
    code: '212',
    name: 'โดมินิกา'
  },
  {
    code: '780',
    name: 'ตรินิแดดและโตเบโก'
  },
  {
    code: '558',
    name: 'นิการากัว'
  },
  {
    code: '076',
    name: 'บราซิล'
  },
  {
    code: '052',
    name: 'บาร์เบโดส'
  },
  {
    code: '044',
    name: 'บาฮามาส'
  },
  {
    code: '084',
    name: 'เบลีซ'
  },
  {
    code: '068',
    name: 'โบลิเวีย'
  },
  {
    code: '591',
    name: 'ปานามา'
  },
  {
    code: '600',
    name: 'ปารากวัย'
  },
  {
    code: '604',
    name: 'เปรู'
  },
  {
    code: '630',
    name: 'เปอร์โตริโก'
  },
  {
    code: '484',
    name: 'เม็กซิโก'
  },
  {
    code: '862',
    name: 'เวเนซุเอลา'
  },
  {
    code: '214',
    name: 'สาธารณรัฐโดมินิกัน'
  },
  {
    code: '032',
    name: 'อาร์เจนตินา'
  },
  {
    code: '858',
    name: 'อุรุกวัย'
  },
  {
    code: '218',
    name: 'เอกวาดอร์'
  },
  {
    code: '222',
    name: 'เอลซัลวาดอร์'
  },
  {
    code: '028',
    name: 'แอนติกาและบาร์บูดา'
  },
  {
    code: '340',
    name: 'ฮอนดูรัส'
  },
  {
    code: '332',
    name: 'เฮติ'
  },
  {
    code: '316',
    name: 'กวม'
  },
  {
    code: '124',
    name: 'แคนาดา'
  },
  {
    code: '580',
    name: 'หมู่เกาะนอร์เทิร์นมาเรียนา'
  },
  {
    code: '850',
    name: 'หมู่เกาะเวอร์จินของสหรัฐอเมริกา'
  },
  {
    code: '016',
    name: 'อเมริกันซามัว'
  },
  {
    code: '288',
    name: 'กานา'
  },
  {
    code: '266',
    name: 'กาบอง'
  },
  {
    code: '324',
    name: 'กินี'
  },
  {
    code: '624',
    name: 'กินีบิสเซา'
  },
  {
    code: '270',
    name: 'แกมเบีย'
  },
  {
    code: '384',
    name: 'โกตดิวัวร์'
  },
  {
    code: '178',
    name: 'คองโก'
  },
  {
    code: '174',
    name: 'คอโมโรส'
  },
  {
    code: '404',
    name: 'เคนยา'
  },
  {
    code: '132',
    name: 'เคปเวิร์ด'
  },
  {
    code: '120',
    name: 'แคเมอรูน'
  },
  {
    code: '262',
    name: 'จิบูตี'
  },
  {
    code: '148',
    name: 'ชาด'
  },
  {
    code: '732',
    name: 'ซาฮาราตะวันตก'
  },
  {
    code: '716',
    name: 'ซิมบับเว'
  },
  {
    code: '736',
    name: 'ซูดาน'
  },
  {
    code: '690',
    name: 'เซเชลส์'
  },
  {
    code: '686',
    name: 'เซเนกัล'
  },
  {
    code: '678',
    name: 'เซาตูเมและปรินซิปี'
  },
  {
    code: '694',
    name: 'เซียร์ราลีโอน'
  },
  {
    code: '894',
    name: 'แซมเบีย'
  },
  {
    code: '706',
    name: 'โซมาเลีย'
  },
  {
    code: '788',
    name: 'ตูนิเซีย'
  },
  {
    code: '768',
    name: 'โตโก'
  },
  {
    code: '516',
    name: 'นามิเบีย'
  },
  {
    code: '566',
    name: 'ไนจีเรีย'
  },
  {
    code: '562',
    name: 'ไนเจอร์'
  },
  {
    code: '072',
    name: 'บอตสวานา'
  },
  {
    code: '108',
    name: 'บุรุนดี'
  },
  {
    code: '854',
    name: 'บูร์กินาฟาโซ'
  },
  {
    code: '204',
    name: 'เบนิน'
  },
  {
    code: '480',
    name: 'มอริเชียส'
  },
  {
    code: '478',
    name: 'มอริเตเนีย'
  },
  {
    code: '450',
    name: 'มาดากัสการ์'
  },
  {
    code: '454',
    name: 'มาลาวี'
  },
  {
    code: '466',
    name: 'มาลี'
  },
  {
    code: '508',
    name: 'โมซัมบิก'
  },
  {
    code: '504',
    name: 'โมร็อกโก'
  },
  {
    code: '800',
    name: 'ยูกันดา'
  },
  {
    code: '646',
    name: 'รวันดา'
  },
  {
    code: '426',
    name: 'เลโซโท'
  },
  {
    code: '430',
    name: 'ไลบีเรีย'
  },
  {
    code: '748',
    name: 'สวาซิแลนด์'
  },
  {
    code: '834',
    name: 'สหสาธารณรัฐแทนซาเนีย'
  },
  {
    code: '180',
    name: 'สาธารณรัฐประชาธิปไตยคองโก'
  },
  {
    code: '140',
    name: 'สาธารณรัฐแอฟริกากลาง'
  },
  {
    code: '434',
    name: 'อาหรับลิเบีย'
  },
  {
    code: '226',
    name: 'อิเควทอเรียลกินี'
  },
  {
    code: '818',
    name: 'อียิปต์'
  },
  {
    code: '231',
    name: 'เอธิโอเปีย'
  },
  {
    code: '232',
    name: 'เอริเทรีย'
  },
  {
    code: '024',
    name: 'แองโกลา'
  },
  {
    code: '710',
    name: 'แอฟริกาใต้'
  },
  {
    code: '012',
    name: 'แอลจีเรีย'
  },
  {
    code: '574',
    name: 'เกาะนอร์ฟอล์ก'
  },
  {
    code: '296',
    name: 'คิริบาตี'
  },
  {
    code: '882',
    name: 'ซามัว'
  },
  {
    code: '776',
    name: 'ตองกา'
  },
  {
    code: '798',
    name: 'ตูวาลู'
  },
  {
    code: '772',
    name: 'โตเกเลา'
  },
  {
    code: '520',
    name: 'นาอูรู'
  },
  {
    code: '554',
    name: 'นิวซีแลนด์'
  },
  {
    code: '570',
    name: 'นีอูเอ'
  },
  {
    code: '598',
    name: 'ปาปัวนิวกินี'
  },
  {
    code: '585',
    name: 'ปาเลา'
  },
  {
    code: '242',
    name: 'ฟิจิ'
  },
  {
    code: '583',
    name: 'ไมโครนีเซีย (สหพันธรัฐ)'
  },
  {
    code: '548',
    name: 'วานูอาตู'
  },
  {
    code: '184',
    name: 'หมู่เกาะคุก'
  },
  {
    code: '090',
    name: 'หมู่เกาะโซโลมอน'
  },
  {
    code: '584',
    name: 'หมู่เกาะมาร์แชลล์'
  },
  {
    code: '036',
    name: 'ออสเตรเลีย'
  },
  {
    code: '901',
    name: 'กะเหรี่ยง'
  },
  {
    code: '909',
    name: 'ขมุ'
  },
  {
    code: '905',
    name: 'ไทยใหญ่/ส่วย/ลื้อ'
  },
  {
    code: '902',
    name: 'ม้ง'
  },
  {
    code: '908',
    name: 'เย้า'
  },
  {
    code: '903',
    name: 'ละหู้'
  },
  {
    code: '906',
    name: 'ลัว'
  },
  {
    code: '907',
    name: 'ลูซู'
  },
  {
    code: '904',
    name: 'อาข่า'
  }
]
